#输出广告牌信息
print("========本店今日提供以下品种========")
print("#           1.香橙磅蛋糕           #")
print("#          2.腊肠咸蛋糕            #")
print("#        3.黑芝麻糖霜蛋糕          #")
print("#    4.大理石咕咕洛夫奶油蛋糕      #")
print("====================================")

#获得输入
num=input('请输入序号查询蛋糕价格：')

#进行处理并输出结果
if int(num)==1:
    print('1.香橙磅蛋糕.单价：',15)
elif int(num)==2:
    print('2.腊肠咸蛋糕.单价：',22)
elif int(num)==3:
    print('3.黑芝麻糖霜蛋糕.单价：',20)
elif int(num)==4:
    print('4.大理石咕咕洛夫奶油蛋糕.单价：',24)
else:
    print('今日没有你所选的蛋糕')
